In [20]:
# autocomplete setting 
%config IPCompleter.greedy=True

# print every line of code
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

In [21]:
# import libs and const vals
import pandas as pd
import numpy as np
import sys
import os

FOLDER_NAME = "tatanic"
PASSENGERID = 'PassengerId'
SURVIVED = 'Survived'
PCLASS = 'Pclass'
NAME = 'Name'
SEX = 'Sex'
AGE = 'Age'
SIBSP = 'SibSp'
PARCH = 'Parch'
TICKET = 'Ticket'
FARE = 'Fare'
CABIN = 'Cabin'
EMBARKED = 'Embarked'


CSV_COLUMNS = [
    PASSENGERID,
    SURVIVED,
    PCLASS,
    NAME,
    SEX,
    AGE,
    SIBSP,
    PARCH,
    TICKET,
    FARE,
    CABIN,
    EMBARKED,
]

print("import libs and init const vals")

import libs and init const vals

In [22]:
# read dataset 

head, _ =  os.path.split(os.getcwd())
train_path = os.path.join(head, "data","titanic",  "train.csv")
test_path = os.path.join(head, "data","titanic",  "test.csv")

train_df = pd.read_csv(train_path)
test_df = pd.read_csv(test_path)

dataset_df = pd.concat([train_df, test_df])
# reset df index 
dataset_df = dataset_df.reset_index(drop=True)

#save merged dataset
merge_set_path = os.path.join(head, "data","titanic",  "merge_set.csv")
dataset_df.to_csv(merge_set_path)

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:10: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=True'.

To retain the current behavior and silence the warning, pass sort=False

  # Remove the CWD from sys.path while we load stuff.

In [23]:
# null count
dataset_df.isnull().sum()

# null count
# Age             263
# Cabin          1014
# Embarked          2
# Fare              1
dataset_df.info()
dataset_df.describe()

Age             263
Cabin          1014
Embarked          2
Fare              1
Name              0
Parch             0
PassengerId       0
Pclass            0
Sex               0
SibSp             0
Survived        418
Ticket            0
dtype: int64

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 12 columns):
Age            1046 non-null float64
Cabin          295 non-null object
Embarked       1307 non-null object
Fare           1308 non-null float64
Name           1309 non-null object
Parch          1309 non-null int64
PassengerId    1309 non-null int64
Pclass         1309 non-null int64
Sex            1309 non-null object
SibSp          1309 non-null int64
Survived       891 non-null float64
Ticket         1309 non-null object
dtypes: float64(3), int64(4), object(5)
memory usage: 122.8+ KB

,Age,Fare,Parch,PassengerId,Pclass,SibSp,Survived
count,1046.000000,1308.000000,1309.000000,1309.000000,1309.000000,1309.000000,891.000000
mean,29.881138,33.295479,0.385027,655.000000,2.294882,0.498854,0.383838
std,14.413493,51.758668,0.865560,378.020061,0.837836,1.041658,0.486592
min,0.170000,0.000000,0.000000,1.000000,1.000000,0.000000,0.000000
25%,21.000000,7.895800,0.000000,328.000000,2.000000,0.000000,0.000000
50%,28.000000,14.454200,0.000000,655.000000,3.000000,0.000000,0.000000
75%,39.000000,31.275000,0.000000,982.000000,3.000000,1.000000,1.000000
max,80.000000,512.329200,9.000000,1309.000000,3.000000,8.000000,1.000000

In [24]:
# fill null at 'Fare'
data = dataset_df['Fare'].fillna(dataset_df['Fare'].mean())
dataset_df['Fare'] = data

dataset_df['Fare'].isnull().sum()

0

In [25]:
# fill null value 'Embarked' 
data = dataset_df['Embarked']

data.unique()
data.isnull().sum()
data.value_counts()
data = data.fillna('S') 

data.unique()
data.isnull().sum()

dataset_df['Embarked'] = data

array(['S', 'C', 'Q', nan], dtype=object)

2

S    914
C    270
Q    123
Name: Embarked, dtype: int64

array(['S', 'C', 'Q'], dtype=object)

0

In [26]:
# fill null value at Age
data = dataset_df['Age']
data.isnull().sum()
data.isnull().mean()

263

0.20091673032849502

In [27]:
# fill null value at cabbin
data = dataset_df['Cabin']
data.isnull().sum()

# data.unique()
# len(data.unique())

data = data[data.notnull()].str.split(" ", expand=True)

1014

In [28]:
# testing np nan check
a = np.array([1.0,2.0,3.0, "3", np.nan, ])
print(a)
print(a.dtype)
print(a[4].dtype)
a = np.where(type(a) == float, -1, a)
print(a)

['1.0' '2.0' '3.0' '3' 'nan']
<U32
<U3
['1.0' '2.0' '3.0' '3' 'nan']

In [40]:
# Ticket 

# %%time

# l = sorted(list(dataset_pd["Ticket"].unique()))
# dataset_df.groupby(["Ticket"])["Survived"].mean()
# train_df.groupby(["Ticket"])["Survived"].agg(['mean', 'count'])
# df = dataset_df.sort_values(["Ticket"])
# df[['Ticket', 'Name', 'Family_size', 'Age','Survived']].groupby(["Ticket"]).agg(['count', 'mean'])

# split ticket to head and and num part
df = dataset_df["Ticket"].str.split(" ")
ticket_head = []
ticket_num = []
for item in df:
    if len(item) == 1:
        ticket_head.append("None")
        ticket_num.append(item[0])
    else:
        ticket_head.append(item[0])
        ticket_num.append(item[-1])
        
ticket = pd.DataFrame(
    {"ticket_head":ticket_head,
     "ticket_num":ticket_num}
)
# ticket

# pd.concat(dataset_df, ticket], axis=1 )
# ticket
# dataset_df
data = pd.concat([dataset_df, ticket], axis=1 )
data.head()


dataset_df['ticket_head'] = ticket_head
dataset_df['ticket_num'] = ticket_num

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket,Family_size,first_name,Honorific,last_name,ticket_head,ticket_num,ticket_head,ticket_num
0,22.0,NaN,S,7.2500,"Braund, Mr. Owen Harris",0,1,3,male,1,0.0,A/5 21171,2,Braund,Mr,Owen Harris,[A/5],21171,A/5,21171
1,38.0,C85,C,71.2833,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,2,1,female,1,1.0,PC 17599,2,Cumings,Mrs,John Bradley,[PC],17599,PC,17599
2,26.0,NaN,S,7.9250,"Heikkinen, Miss. Laina",0,3,3,female,0,1.0,STON/O2. 3101282,1,Heikkinen,Miss,Laina,[STON/O2.],3101282,STON/O2.,3101282
3,35.0,C123,S,53.1000,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,4,1,female,1,1.0,113803,2,Futrelle,Mrs,Jacques Heath,None,113803,None,113803
4,35.0,NaN,S,8.0500,"Allen, Mr. William Henry",0,5,3,male,0,0.0,373450,1,Allen,Mr,William Henry,None,373450,None,373450

In [30]:
# add Family_size attr
dataset_df['Family_size'] =  dataset_df['SibSp'] + dataset_df['Parch'] + 1
# dataset_df.head()
dataset_df.groupby(['Family_size','Sex'])['Survived'].agg(['mean', 'count'])

                        mean  count
Family_size Sex
1           female  0.785714    126
            male    0.155718    411
2           female  0.816092     87
            male    0.243243     74
3           female  0.775510     49
            male    0.396226     53
4           female  0.842105     19
            male    0.500000     10
5           female  0.250000     12
            male    0.000000      3
6           female  0.375000      8
            male    0.000000     14
7           female  0.375000      8
            male    0.250000      4
8           female  0.000000      2
            male    0.000000      4
11          female  0.000000      3
            male    0.000000      4

In [53]:
# Name
data = dataset_df['Name']
# data.str.split(" ")
# data.str.split("")


# split full_name and alias_name
data = data.str.split("(", expand=True)
full_name = data[0]
alias_name = data[1]

# alias_name has null value
alias_name[alias_name.notnull()].count()

# mean of people who have alias_name 
# maybe predict Age
dataset_df["Age"][alias_name.str.contains('"').notnull()].mean()

alias_name = alias_name.str.replace(")","")
alias_name = alias_name.str.replace('"',"")

full_name.isnull().sum()
full_name.str.contains('"').sum()

# '"' include in fullname people is young
# maybe predict Age
dataset_df["Age"][full_name.str.contains('"')].mean()

# split full_name to fisrt honorific last
full_name = full_name.str.split(",", expand=True)
first_name = pd.Series(full_name[0]) 

full_name = full_name[1].str.split(".", expand=True)
Honorific = full_name[0]
last_name = full_name[1]

full_name = pd.DataFrame({
    "first_name":first_name,
    "Honorific":Honorific,
    "last_name": last_name
})
full_name.head()
Honorific.value_counts()


# data.groupby("Honorific")['Survived'].agg(["mean", "count", "sum"])

dataset_df.groupby("Honorific")['Age','Survived'].agg(['min',"mean",'max', "count", "sum", 'std'])


dataset_df["first_name"] = first_name
dataset_df['Honorific'] = Honorific
dataset_df["last_name"] = last_name

dataset_df.head()

221

36.339473684210525

0

42

17.507083333333334

  first_name Honorific        last_name
0     Braund        Mr      Owen Harris
1    Cumings       Mrs    John Bradley
2  Heikkinen      Miss            Laina
3   Futrelle       Mrs   Jacques Heath
4      Allen        Mr    William Henry

 Mr              757
 Miss            260
 Mrs             197
 Master           61
 Dr                8
 Rev               8
 Col               4
 Ms                2
 Major             2
 Mlle              2
 Don               1
 Mme               1
 Dona              1
 Capt              1
 Jonkheer          1
 Lady              1
 the Countess      1
 Sir               1
Name: 0, dtype: int64

                 Age                                             Survived  \
                 min       mean   max count       sum        std      min
Honorific
 Capt          70.00  70.000000  70.0     1     70.00        NaN      0.0
 Col           47.00  54.000000  60.0     4    216.00   5.477226      0.0
 Don           40.00  40.000000  40.0     1     40.00        NaN      0.0
 Dona          39.00  39.000000  39.0     1     39.00        NaN      NaN
 Dr            23.00  43.571429  54.0     7    305.00  11.731115      0.0
 Jonkheer      38.00  38.000000  38.0     1     38.00        NaN      0.0
 Lady          48.00  48.000000  48.0     1     48.00        NaN      1.0
 Major         45.00  48.500000  52.0     2     97.00   4.949747      0.0
 Master         0.33   5.482642  14.5    53    290.58   4.161554      0.0
 Miss           0.17  21.774238  63.0   210   4572.59  12.249077      0.0
 Mlle          24.00  24.000000  24.0     2     48.00   0.000000      1.0
 Mme           24.00  24.000000  24.0     1     24.00        NaN      1.0
 Mr            11.00  32.252151  80.0   581  18738.50  12.422089      0.0
 Mrs           14.00  36.994118  76.0   170   6289.00  12.901767      0.0
 Ms            28.00  28.000000  28.0     1     28.00        NaN      1.0
 Rev           27.00  41.250000  57.0     8    330.00  12.020815      0.0
 Sir           49.00  49.000000  49.0     1     49.00        NaN      1.0
 the Countess  33.00  33.000000  33.0     1     33.00        NaN      1.0


                   mean  max count    sum       std
Honorific
 Capt          0.000000  0.0     1    0.0       NaN
 Col           0.500000  1.0     2    1.0  0.707107
 Don           0.000000  0.0     1    0.0       NaN
 Dona               NaN  NaN     0    0.0       NaN
 Dr            0.428571  1.0     7    3.0  0.534522
 Jonkheer      0.000000  0.0     1    0.0       NaN
 Lady          1.000000  1.0     1    1.0       NaN
 Major         0.500000  1.0     2    1.0  0.707107
 Master        0.575000  1.0    40   23.0  0.500641
 Miss          0.697802  1.0   182  127.0  0.460477
 Mlle          1.000000  1.0     2    2.0  0.000000
 Mme           1.000000  1.0     1    1.0       NaN
 Mr            0.156673  1.0   517   81.0  0.363844
 Mrs           0.792000  1.0   125   99.0  0.407510
 Ms            1.000000  1.0     1    1.0       NaN
 Rev           0.000000  0.0     6    0.0  0.000000
 Sir           1.000000  1.0     1    1.0       NaN
 the Countess  1.000000  1.0     1    1.0       NaN

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket,Family_size,first_name,Honorific,last_name,ticket_head,ticket_num
0,22.0,NaN,S,7.2500,"Braund, Mr. Owen Harris",0,1,3,male,1,0.0,A/5 21171,2,Braund,Mr,Owen Harris,A/5,21171
1,38.0,C85,C,71.2833,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,2,1,female,1,1.0,PC 17599,2,Cumings,Mrs,John Bradley,PC,17599
2,26.0,NaN,S,7.9250,"Heikkinen, Miss. Laina",0,3,3,female,0,1.0,STON/O2. 3101282,1,Heikkinen,Miss,Laina,STON/O2.,3101282
3,35.0,C123,S,53.1000,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,4,1,female,1,1.0,113803,2,Futrelle,Mrs,Jacques Heath,None,113803
4,35.0,NaN,S,8.0500,"Allen, Mr. William Henry",0,5,3,male,0,0.0,373450,1,Allen,Mr,William Henry,None,373450

In [32]:
train_df.groupby(['Pclass', 'Sex'])['Survived'].mean()

Pclass  Sex
1       female    0.968085
        male      0.368852
2       female    0.921053
        male      0.157407
3       female    0.500000
        male      0.135447
Name: Survived, dtype: float64

In [37]:
df = dataset_df
df.columns
# add isFather

# add isMother

# add race

Index(['Age', 'Cabin', 'Embarked', 'Fare', 'Name', 'Parch', 'PassengerId',
       'Pclass', 'Sex', 'SibSp', 'Survived', 'Ticket', 'Family_size',
       'first_name', 'Honorific', 'last_name', 'ticket_head', 'ticket_num'],
      dtype='object')

In [42]:
#save merged dataset
merge_set_path = os.path.join(head, "data","titanic",  "merge_set.csv")
dataset_df.to_csv(merge_set_path)